//==============================================================================
// HardwareTimer.h
//==============================================================================
#pragma once
#include <CRST_Core/CRST_Core.h>
//==============================================================================
namespace Crystal::Time
{
	class Duration;
	/**
	 * @brief 硬件计时器
	 * @details 唯一职责为从外部设备获取当前时间
	 */
	class TimerBase
	{
	public:
		//==============================================================================
		TimerBase() = default;
		virtual ~TimerBase() = default;
		CRST_NON_COPYABLE(TimerBase)
		//==============================================================================
		/**
		 * @brief 获取当前时间
		 * @return 外部设备返回的当前 
		 */
		virtual CRSTu64 getAbsoluteTimeNano() noexcept = 0;
		//==============================================================================
	};
}
namespace Crystal::Time
{
	std::unique_ptr<TimerBase> createTimer();
}
//==============================================================================